w809291634/eelab_test_f407/CH02/06-Camera/Camera/zonesion/Source/common/lcd/ili9806.c
  LCD_WR_REG(0xBD); // GIP 2
  LCD_WR_DATA(0x01);
  LCD_WR_DATA(0x23);
  LCD_WR_DATA(0x45);
  LCD_WR_DATA(0x67);
  LCD_WR_DATA(0x01);
  LCD_WR_DATA(0x23);
  LCD_WR_DATA(0x45);
  LCD_WR_DATA(0x67);
  
  LCD_WR_REG(0xBE); // GIP 3
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x21);
  LCD_WR_DATA(0xAB);
  LCD_WR_DATA(0x60);
  LCD_WR_DATA(0x22);
  LCD_WR_DATA(0x22);
  LCD_WR_DATA(0x22);
  LCD_WR_DATA(0x22);
  LCD_WR_DATA(0x22);
  
  LCD_WR_REG(0xC7); // VCOM Control
  LCD_WR_DATA(0x30);
  
  LCD_WR_REG(0xED); // EN_volt_reg
  LCD_WR_DATA(0x7F);
  LCD_WR_DATA(0x0F);
  LCD_WR_DATA(0x00);
  
  LCD_WR_REG(0xC0); // Power Control 1
  LCD_WR_DATA(0x03);
  LCD_WR_DATA(0x0B);
  LCD_WR_DATA(0x0C);//0A  VGH VGL
  
  LCD_WR_REG(0xFD);//External Power Selection Set
  LCD_WR_DATA(0x0A);
  LCD_WR_DATA(0x00);
  
  LCD_WR_REG(0xFC); // LVGL
  LCD_WR_DATA(0x08);
  
  LCD_WR_REG(0xDF); // Engineering Setting
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x20);
  
  LCD_WR_REG(0xF3); // DVDD Voltage Setting
  LCD_WR_DATA(0x74);
  
  LCD_WR_REG(0xB4); // Display Inversion Control
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x00);
  
  LCD_WR_REG(0xB5); //Blanking Porch Control
  LCD_WR_DATA(0x08);
  LCD_WR_DATA(0x15);
  
  LCD_WR_REG(0xF7); // 480x854
  LCD_WR_DATA(0x81);
  
  LCD_WR_REG(0xB1); // Frame Rate Control
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x13);
  LCD_WR_DATA(0x13);
  
  LCD_WR_REG(0xF2); //Panel Timing Control
  LCD_WR_DATA(0x80);
  LCD_WR_DATA(0x04);
  LCD_WR_DATA(0x40);
  LCD_WR_DATA(0x28);
  
  LCD_WR_REG(0xC1); //Power Control 2
  LCD_WR_DATA(0x17);
  LCD_WR_DATA(0x71);//VGMP
  LCD_WR_DATA(0x71); //VGMN
  
  LCD_WR_REG(0xE0);        //P_Gamma
  LCD_WR_DATA(0x00); //P1
  LCD_WR_DATA(0x13); //P2
  LCD_WR_DATA(0x1A); //P3
  LCD_WR_DATA(0x0C); //P4
  LCD_WR_DATA(0x0E); //P5
  LCD_WR_DATA(0x0B); //P6
  LCD_WR_DATA(0x07); //P7
  LCD_WR_DATA(0x05); //P8
  LCD_WR_DATA(0x05); //P9
  LCD_WR_DATA(0x0A); //P10
  LCD_WR_DATA(0x0F); //P11
  LCD_WR_DATA(0x0F); //P12
  LCD_WR_DATA(0x0E); //P13
  LCD_WR_DATA(0x1C); //P14
  LCD_WR_DATA(0x16); //P15
  LCD_WR_DATA(0x00); //P16
  
  LCD_WR_REG(0xE1);        //N_Gamma
  LCD_WR_DATA(0x00); //P1
  LCD_WR_DATA(0x13); //P2
  LCD_WR_DATA(0x1A); //P3
  LCD_WR_DATA(0x0C); //P4
  LCD_WR_DATA(0x0E); //P5
  LCD_WR_DATA(0x0B); //P6
  LCD_WR_DATA(0x07); //P7
  LCD_WR_DATA(0x05); //P8
  LCD_WR_DATA(0x05); //P9
  LCD_WR_DATA(0x0A); //P10
  LCD_WR_DATA(0x0F); //P11
  LCD_WR_DATA(0x0F); //P12
  LCD_WR_DATA(0x0E); //P13
  LCD_WR_DATA(0x1C); //P14
  LCD_WR_DATA(0x16); //P15
  LCD_WR_DATA(0x00); //P16
  
  LCD_WR_REG(0x3A);
  LCD_WR_DATA(0x55); //55-16BIT,66-18BIT,77-24BIT
  
  LCD_WR_REG(0x36); //Memory Access Control
  LCD_WR_DATA(0x00); //01-180
  //*****************
  LCD_WR_REG(0x2A); //480
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x01);
  LCD_WR_DATA(0xdf);
  
  LCD_WR_REG(0x2B); //854
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x00);
  LCD_WR_DATA(0x03);
  LCD_WR_DATA(0x55);
  //*****************************
  
  LCD_WR_REG(0x11);
  LCD_delay(120);
  LCD_WR_REG(0x29);
  LCD_delay(25);
  LCD_WR_REG(0x2C);
  
  LCD_delay(10);
  Lcd_Light_ON;	//开启背光
  LCD_Display_Dir(1);		//0竖屏  1横屏
  LCD_Clear(BLACK);
}  

/*
****************************************************************
*功能: 清屏函数
*参数: 填充的颜色和位置	
****************************************************************
*/
void LCD_Clear(u16 color)
{
	u16 x=0,y=0;
	u32 index=0;
	u32 totalpoint = lcd_dev.width;
	totalpoint *= lcd_dev.height;
  
	LCD_WR_REG(0X2A);		/* column address control set */
	LCD_WR_DATA(x>>8);	/* 先高8位，然后低8位 */
	LCD_WR_DATA(x&0xff);	/* 设置起始点和结束点*/
	LCD_WR_DATA((lcd_dev.width) >>8);
	LCD_WR_DATA((lcd_dev.width) &0xff);
  
	LCD_WR_REG(0X2B);		/* page address control set */
	LCD_WR_DATA(y>>8);
	LCD_WR_DATA(y&0xff);	
	LCD_WR_DATA((lcd_dev.height) >>8);
	LCD_WR_DATA((lcd_dev.height) &0xff);
	
	LCD_WR_REG(0x2C);			//写入GRAM
	
	for( index=0;index < totalpoint ; index++ )
	{
		LCD_WR_DATA( color );
	}
}

/*
****************************************************************
*功能: 填充函数
*参数: 填充的颜色和位置	
****************************************************************
*/
void LCD_Fill(u16 x, u16 y, u16 width, u16 height, u16 color)
{
	u32 i = 0;
	
	LCD_WR_REG(0X2A);
	LCD_WR_DATA( x >> 8 );				/* 先高8位，然后低8位 */
	LCD_WR_DATA( x & 0xff );			/* column start   */ 
	LCD_WR_DATA( (x+width-1) >> 8 );	/* column end   */
	LCD_WR_DATA( (x+width-1) & 0xff );
	
  LCD_WR_REG(0X2B); 			     
	LCD_WR_DATA( y >> 8 );				/* page start   */
	LCD_WR_DATA( y & 0xff );
	LCD_WR_DATA( (y+height-1) >> 8);	/* page end     */
	LCD_WR_DATA( (y+height-1) & 0xff);
	
	LCD_WR_REG(0x2c);					/* memory write */
  
	for( i=0; i < width*height; i++ )
	{
		LCD_WR_DATA( color );
	}
}

//在指定区域内填充指定颜色
//区域大小:(xend-xsta+1)*(yend-ysta+1)
//xsta
//color:要填充的颜色
void LCD_Fill_s(u16 sx, u16 sy, u16 ex, u16 ey, u16 color)
{
  u16 i, j;
  u16 xlen = 0;

  xlen = ex - sx + 1;

  for (i = sy; i <= ey; i++){
    LCD_SetCursor(sx, i);       //设置光标位置
    LCD_WriteRAM_Prepare();     //开始写入GRAM
    for (j = 0; j < xlen; j++){
      LCD_WR_DATA( color );
    }
  }
}


/*
***********************************************************************
*功能: 画水平线
*参数: x1 y1  线起点位置
*		 x2 y2  线终点位置
***********************************************************************
*/
void LCD_DrawLine(u16 x1, u16 y1, u16 x2, u16 y2)
{
	u16 t; 
	int xerr=0,yerr=0,delta_x,delta_y,distance; 
	int incx,incy,uRow,uCol; 
	delta_x=x2-x1; //计算坐标增量 
	delta_y=y2-y1; 
	uRow=x1; 
	uCol=y1; 
	if(delta_x>0)incx=1; //设置单步方向 
	else if(delta_x==0)incx=0;//垂直线 
	else {incx=-1;delta_x=-delta_x;} 
	if(delta_y>0)incy=1; 
	else if(delta_y==0)incy=0;//水平线 
	else{incy=-1;delta_y=-delta_y;} 
	if( delta_x>delta_y)distance=delta_x; //选取基本增量坐标轴 
	else distance=delta_y; 
	for(t=0;t<=distance+1;t++ )//画线输出 
	{  
		LCD_DrawPoint(uRow, uCol);//画点 
		xerr+=delta_x ; 
		yerr+=delta_y ; 
		if(xerr>distance) 
		{ 
			xerr-=distance; 
			uRow+=incx; 
		} 
		if(yerr>distance) 
		{ 
			yerr-=distance; 
			uCol+=incy; 
		} 
	}  
}  


