w809291634/eelab_test_f407/CH02/06-Camera/Camera/zonesion/Source/common/lcd/ili9806.c
/*
****************************************************************
*功能: 画矩形
*参数: 矩形对角坐标
****************************************************************
*/
void LCD_DrawRectangle(u16 x1, u16 y1, u16 x2, u16 y2)
{
	LCD_DrawLine(x1,y1,x2,y1);
	LCD_DrawLine(x1,y1,x1,y2);
	LCD_DrawLine(x1,y2,x2,y2);
	LCD_DrawLine(x2,y1,x2,y2);
}

/*
****************************************************************
*功能: 画圆
*参数: 原点坐标和半径
****************************************************************
*/
void LCD_Draw_Circle(u16 x,u16 y,u8 r)
{
	int a,b;
	int di;
	a=0;b=r;	  
	di=3-(r<<1);             //判断下个点位置的标志
	while(a<=b)
	{
		LCD_DrawPoint(x+a,y-b);             //5
 		LCD_DrawPoint(x+b,y-a);             //0           
		LCD_DrawPoint(x+b,y+a);             //4               
		LCD_DrawPoint(x+a,y+b);             //6 
		LCD_DrawPoint(x-a,y+b);             //1       
 		LCD_DrawPoint(x-b,y+a);             
		LCD_DrawPoint(x-a,y-b);             //2             
    LCD_DrawPoint(x-b,y-a);             //7     	         
		a++;
		//使用Bresenham算法画圆     
		if(di<0)di +=4*a+6;	  
		else
		{
			di+=10+4*(a-b);   
			b--;
		} 						    
	}
} 

/*
****************************************************************
*功能: 显示一个字符
*参数: 位置、字符、大小
****************************************************************
*/
void LCD_ShowChar(u16 x,u16 y,u8 num,u8 size,u8 mode)
{  							  
	u8 temp,t1,t;
	u16 y0=y;
	u8 csize=(size/8+((size%8)?1:0))*(size/2);		  //得到字体一个字符对应点阵集所占的字节数	
 	num=num-' ';//得到偏移后的值（ASCII字库是从空格开始取模，所以-' '就是对应字符的字库）
	for(t=0;t<csize;t++)
	{   
		if(size==12)temp=tft_asc2_1206[num][t]; 	 	  //调用1206字体
		else if(size==16)temp=tft_asc2_1608[num][t];	//调用1608字体
		else if(size==24)temp=tft_asc2_2412[num][t];	//调用2412字体
    else if(size==40)temp=tft_asc2_4020[num][t];	//调用4020字体
		else return;								//没有的字库
		for(t1=0;t1<8;t1++)
		{			    
			if(temp&0x80)LCD_Fast_DrawPoint(x,y,POINT_COLOR);
			else if(mode==0)LCD_Fast_DrawPoint(x,y,BACK_COLOR);
			temp<<=1;
			y++;
			if(y>=lcd_dev.height)return;		//超区域了
			if((y-y0)==size)
			{
				y=y0;
				x++;
				if(x>=lcd_dev.width)return;	//超区域了
				break;
			}
		}  	 
	}   	 	  
}

/*
****************************************************************
* 功能：显示一个字符 ，适配 应用层
*       绘制格式：阴码+逐列式+顺向+C51格式
* 参数：x，y：显示坐标，num：字符，color：字符颜色，bc：背景色
* 返回：无
****************************************************************
*/
void LCDDrawChar(int x, int y, char num, u8 size,int color, int bc)
{  							  
	u8 temp,t1,t;
  u16 y0=y;
	u8 csize=(size/8+((size%8)?1:0))*(size/2);		  //得到字体一个字符对应点阵集所占的字节数	
 	num=num-' ';
  /* num:行  t:列  具体字节 */
	for(t=0;t<csize;t++)
	{   
    /* 取具体的字节 */
		if(size==12)temp=tft_asc2_1206[num][t]; 	 	  //调用1206字体
		else if(size==16)temp=tft_asc2_1608[num][t];	//调用1608字体
		else if(size==24)temp=tft_asc2_2412[num][t];	//调用2412字体
    else if(size==32)temp=tft_asc2_3216[num][t];	//调用3216字体
    else if(size==40)temp=tft_asc2_4020[num][t];	//调用4020字体
		else {
      printf("LCDDrawChar No font library\r\n");
      return;								//没有的字库
    }
    /* 绘制字体 */
		for(t1=0;t1<8;t1++)
		{			    
			if(temp&0x80)LCD_Fast_DrawPoint(x,y,color);
			else if(bc>0)LCD_Fast_DrawPoint(x,y,bc);
			temp<<=1;
			y++;
			if(y>=lcd_dev.height)return;		//超区域了
      /* 切换到下一列 */
			if((y-y0)==size)
			{
				y=y0;
				x++;
				if(x>=lcd_dev.width)return;	//超区域了
				break;
			}
		}    	 
	}   	 	  
}

/*
****************************************************************
*功能: 幂函数
*参数: 
****************************************************************
*/
u32 LCD_Pow(u8 m,u8 n)
{
	u32 result=1;	 
	while(n--)result*=m;    
	return result;
}

/*
****************************************************************
*功能: 显示数字
*参数: 位置、数值、长度、大小
****************************************************************
*/
void LCD_ShowNum(u16 x,u16 y,u32 num,u8 len,u8 size)
{         	
	u8 t,temp;
	u8 enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/LCD_Pow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
				LCD_ShowChar(x+(size/2)*t,y,' ',size,0);
				continue;
			}else enshow=1; 
      
		}
	 	LCD_ShowChar(x+(size/2)*t,y,temp+'0',size,0); 
	}
} 

/*
****************************************************************
*功能: 显示字符串
*参数: 位置、数值、颜色、大小
****************************************************************
*/
void LCD_ShowString(u16 x,u16 y,u16 width,u16 height,u8 size,u8 *p)
{         
	u8 x0=x;
	width+=x;
	height+=y;
  while((*p<='~')&&(*p>=' '))     // 判断是不是非法字符!
  {       
    if(x>=width){x=x0;y+=size;}   // 换行
    if(y>=height)break;           // 退出
    LCD_ShowChar(x,y,*p,size,0);
    x+=size/2;
    p++;
  }  
}

// lcd在指定宽度居中显示字符
// x,y:起始坐标值
// str 字符  len绘制宽度
void LCD_ShowString_Mid(u16 x,u16 y,u16 len,u8 size,char *str)
{         
  u16 usesize;
  
  // 获取多少个字符
  char *p=str;
  u8 str_num=0;
  while(*p!=0){ 
    if(*p<0x80){
      p++;
      str_num++;
    }
    /* 中文 */
    else return;					 
  }
  usesize = size/2*str_num ;     // 当前显示文本占用像素
 
  if(usesize>len){
    printf("LCD_ShowString_Mid parameter error!\r\n");
    return;
  }
  usesize=(len-usesize)/2;                            // 起点偏移量
  LCD_ShowString(usesize+x,y,len,size,size,(u8*)str);
}
